[
  "* The explosion was much bigger than Jim had anticipated. It started with white-hot fire ejecting from the tube integrated into one side of the Razak ship. A series of explosions burst from the hull in a circle. Then, they connected with the first and completed the cycle. Selenium in the catalyst tanks reached critical levels and the entire thing blew up like a sun going nova. Jim held his arm in front of his eyes as blinding light filled the bridge. As it dissipated, he looked again to the Star Destroyer. Half of the ship was gone. It looked like a giant monster had taken a bite out of the ship. A full third of it was missing. The Resolve's comm screen blinked, and Jim turned it back on. Smoke filled the dimly lit bridge Krazirk coughed twice. \"What have you done?\" \"I warned you of the consequences,\" Jim said. \"On Earth, we have a saying about pride leading to downfall.\" \"No, fool,\" Krazirk hacked, his face growing an unnatural purple. \"The gas entered our life support. You've poisoned us.\" In the viewscreen's background, a thin yellow-green haze permeated the air. Most of the Razak had already succumbed to the gas and slumped in their seats. Krazirk stood firm, but his grip on the chair beside him didn't escape Jim's notice. Jim cringed. He'd wanted to disable their ship, not kill everyone aboard. His face probably matched the sickly color of the air behind Krazirk. \"Surrender now,\" Jim said, \"and we will try to rescue you.\" \"The Razak don't surrender.\" The alien's grip faltered, and he fell. Jim watched as he struggled back to his feet. \"But we do avenge,\" Krazirk gurgled. \"We know how to defeat you,\" Jim said. \"The result might not be pretty, but the Earth now knows the Razak can be defeated. Comms screen off.\" Jim slumped back into his chair and let out a big sigh. \"What did I do?\" Melissa stood from her station and gave her stepfather a hug. \"You did what you had to do. None of us could have predicted it would turn out that way.\" \"I guess.\" But Jim didn't feel",
  "relieved. Bobby turned his seat around to face Jim, biting his lip. \"That's not our only problem. The Resolve is dead. We're stuck in the asteroid belt with no way to get home.\" The statement darkened the already somber mood. \"Maybe we deserve to die out here.\" Jim stood and leaned over Melissa's chair, peering into her star chart, as if he could will the distance between the Earth and themselves to shorten. \"I just wish I could get you three home.\" \"We aren't leaving without you, Dad.\" \"We aren't leaving with him either,\" Bobby said, \"not unless we can figure something out.\" Chris hitched a thumb at the viewscreen. \"What about their ship?\" \"Uh, that thing's not going anywhere. And even if it could, I'm not flying home with a bunch of dead bodies.\" Melissa crossed her arms. \"I'd rather die out here than do that.\" \"Bobby, do you think you can repair the Resolve with parts from that wreck?\" Jim straightened as a plan germinated. \"From what I've been reading about Fagare history, the human spacefaring races have been trading with each other for so long that all parts are fairly standardized. With the help of our repair drone, especially if I can liberate another one or two from theirs, I can do it.\" \"Good. We'll do that. Bobby, ready the shuttle.\" \"Captain, you sure that's a good idea?\" Melissa asked. \"We don't know what's on that ship.\" \"Relax, Mel. They're all dead. What's the worst that could happen?\""
]